# Part A

In [1]:
import pandas as pd

In [3]:
a = [1,4,3,7,6,2,3]
a

[1, 4, 3, 7, 6, 2, 3]

In [4]:
type(a)

list

# 1.converting the list into series

In [5]:
a = pd.Series(a)

In [6]:
type(a)

pandas.core.series.Series

In [7]:
a

0    1
1    4
2    3
3    7
4    6
5    2
6    3
dtype: int64

# 2.max and min value of a series

In [9]:
a.max()

7

In [10]:
a.min()

1

# 3.sorting values in a series

In [12]:
a.sort_values()

0    1
5    2
2    3
6    3
1    4
4    6
3    7
dtype: int64

In [13]:
a.sort_values(ascending=False)

3    7
4    6
1    4
6    3
2    3
5    2
0    1
dtype: int64

In [23]:
a.sort_values(inplace=True)

In [24]:
a

0    1
5    2
2    3
6    3
1    4
4    6
3    7
dtype: int64

# 4.slicing operations

In [25]:
a[:4] #returns values from 0 to 4th index

0    1
5    2
2    3
6    3
dtype: int64

In [34]:
b = [1,4,3,7,6,2,3]

In [35]:
b = pd.Series(b)

In [81]:
b

SyntaxError: invalid syntax (<ipython-input-81-a29437b02aa4>, line 4)

In [38]:
b[::-1] #reversing the order

6    3
5    2
4    6
3    7
2    3
1    4
0    1
dtype: int64

In [39]:
b.sort_values()

0    1
5    2
2    3
6    3
1    4
4    6
3    7
dtype: int64

# Part B

# 1. Loading data from URL/Github

In [56]:
import pandas as pd

In [59]:
url= "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/titanic.csv"
df= pd.read_csv(url)
df.head()  #reads 5 elements by default

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0

# 2. df.loc[row_label, cloumn_label]

In [61]:
df.loc[1, 'name'] #returns the 1st index/row and name column

'Allison, Master. Hudson Trevor'

In [63]:
df.loc[0, 'ticket'] #returns the 0th row and ticket column

'24160'

# 3. slicing an entire column and other slicing operations

In [73]:
names = df.loc[:,"name"] #slicing name column
names.head()

0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
Name: name, dtype: object

In [70]:
df[:4] #slicing 0 to 4th element

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0

In [82]:
#df[::-1] #reversing the idices

# 4. slicing rows

In [80]:
df.loc[0] #0th row details

pclass                                  1
name        Allen, Miss. Elisabeth Walton
sex                                female
age                                    29
sibsp                                   0
parch                                   0
ticket                              24160
fare                              211.338
cabin                                  B5
embarked                                S
survived                                1
Name: 0, dtype: object

In [103]:
#slicing mutiple rows and colums

df.loc[2:4,["name","sex"]]

                                              name     sex
2                     Allison, Miss. Helen Loraine  female
3             Allison, Mr. Hudson Joshua Creighton    male
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

In [104]:
#slicing multiple rows and all colums

df.loc[2:4,:]

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
2,1,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.55,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.55,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.55,C22 C26,S,0

# slicing using iloc

df.iloc[0,1] #0th index row and 1st column

In [92]:
#slicing multiple colums

df[["name", "sex"]].head(3) #it can be also written as  df.loc[:,["name", "sex"]].head(3)

                             name     sex
0   Allen, Miss. Elisabeth Walton  female
1  Allison, Master. Hudson Trevor    male
2    Allison, Miss. Helen Loraine  female

In [95]:
df.iloc[:,["name", "sex"]]

                                                   name     sex
0                         Allen, Miss. Elisabeth Walton  female
1                        Allison, Master. Hudson Trevor    male
2                          Allison, Miss. Helen Loraine  female
3                  Allison, Mr. Hudson Joshua Creighton    male
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
5                                   Anderson, Mr. Harry    male
6                     Andrews, Miss. Kornelia Theodosia  female
7                                Andrews, Mr. Thomas Jr    male
8         Appleton, Mrs. Edward Dale (Charlotte Lamson)  female
9                               Artagaveytia, Mr. Ramon    male
10                               Astor, Col. John Jacob    male
11    Astor, Mrs. John Jacob (Madeleine Talmadge Force)  female
12                        Aubart, Mme. Leontine Pauline  female
13                         Barber, Miss. Ellen "Nellie"  female
14                 Barkworth, Mr. Algernon Henry Wilson    male
15                                  Baumann, Mr. John D    male
16                             Baxter, Mr. Quigg Edmond    male
17      Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female
18                                Bazzani, Miss. Albina  female
19                                 Beattie, Mr. Thomson    male
20                        Beckwith, Mr. Richard Leonard    male
21     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female
22                                Behr, Mr. Karl Howell    male
23                                Bidois, Miss. Rosalie  female
24                                    Bird, Miss. Ellen  female
25                                  Birnbaum, Mr. Jakob    male
26                              Bishop, Mr. Dickinson H    male
27              Bishop, Mrs. Dickinson H (Helen Walton)  female
28                               Bissette, Miss. Amelia  female
29            Bjornstrom-Steffansson, Mr. Mauritz Hakan    male
...                                                 ...     ...
1279               Vestrom, Miss. Hulda Amanda Adolfina  female
1280                                    Vovk, Mr. Janko    male
1281                               Waelens, Mr. Achille    male
1282                                Ware, Mr. Frederick    male
1283                        Warren, Mr. Charles William    male
1284                                  Webber, Mr. James    male
1285                                Wenzel, Mr. Linhart    male
1286    Whabee, Mrs. George Joseph (Shawneene Abi-Saab)  female
1287                   Widegren, Mr. Carl/Charles Peter    male
1288                          Wiklund, Mr. Jakob Alfred    male
1289                            Wiklund, Mr. Karl Johan    male
1290                   Wilkes, Mrs. James (Ellen Needs)  female
1291                   Willer, Mr. Aaron ("Abi Weller")    male
1292                                 Willey, Mr. Edward    male
1293                  Williams, Mr. Howard Hugh "Harry"    male
1294                               Williams, Mr. Leslie    male
1295                                Windelov, Mr. Einar    male
1296                                   Wirz, Mr. Albert    male
1297                             Wiseman, Mr. Phillippe    male
1298                          Wittevrongel, Mr. Camille    male
1299                                Yasbeck, Mr. Antoni    male
1300            Yasbeck, Mrs. Antoni (Selini Alexander)  female
1301                               Youseff, Mr. Gerious    male
1302                                  Yousif, Mr. Wazli    male
1303                              Yousseff, Mr. Gerious    male
1304                               Zabour, Miss. Hileni  female
1305                              Zabour, Miss. Thamine  female
1306                          Zakarian, Mr. Mapriededer    male
1307                                Zakarian, Mr. Ortin    male
1308                                 Zimmerman, Mr. Leo    male

[1309 rows x 2 columns]

# Part C

# 1. Numeric operations on Series

In [109]:
#creating a simple dataframe

simple_df= pd.DataFrame({
    'a': [1,2,3,4,5,6],
    'b': [11,12,13,14,7,9]
})

simple_df

   a   b
0  1  11
1  2  12
2  3  13
3  4  14
4  5   7
5  6   9

In [113]:
#extarcting series from dataframe

simple_df['a']

0    1
1    2
2    3
3    4
4    5
5    6
Name: a, dtype: int64

In [115]:
b= simple_df['b']
b

0    11
1    12
2    13
3    14
4     7
5     9
Name: b, dtype: int64

In [116]:
# adding the two series

c= a+b

In [117]:
c

0    12.0
1    16.0
2    16.0
3    21.0
4    13.0
5    11.0
6     NaN
dtype: float64

In [130]:
#similarly for strings

simple_df2= pd.DataFrame({
    'e': ['x','ab', 'xz'],
    'f': ['abble', "dodu", 'machu']
})

In [131]:
e=simple_df2['e']

In [132]:
f=simple_df2['f']

In [133]:
k=e+f
k

0     xabble
1     abdodu
2    xzmachu
dtype: object

# 2. Descriptive stats on series

In [134]:
a.min()

1

In [135]:
a.max()

7

In [136]:
a.mean()

3.7142857142857144

In [137]:
a.std()

2.1380899352993947

In [138]:
a.median()

3.0

In [139]:
a.mode()

0    3
dtype: int64

In [140]:
a.sum()

26

In [141]:
a.value_counts()

3    2
7    1
6    1
4    1
2    1
1    1
dtype: int64

In [144]:
a.describe()

count    7.000000
mean     3.714286
std      2.138090
min      1.000000
25%      2.500000
50%      3.000000
75%      5.000000
max      7.000000
dtype: float64

In [146]:
#similarly for our titanic dataframe

df["sex"].describe()

count     1309
unique       2
top       male
freq       843
Name: sex, dtype: object

In [149]:
#function unique()

df['pclass'].unique()

array([1, 2, 3], dtype=int64)

In [150]:

#arithmetic operation on multiple columns

df[['fare','age']].mean()

fare    33.295479
age     29.881135
dtype: float64

In [152]:
#some more operations

df.mean(numeric_only=True)

pclass       2.294882
age         29.881135
sibsp        0.498854
parch        0.385027
fare        33.295479
survived     0.381971
dtype: float64

In [153]:
df.median(numeric_only=True)

pclass       3.0000
age         28.0000
sibsp        0.0000
parch        0.0000
fare        14.4542
survived     0.0000
dtype: float64